fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПревышаетНорму</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДанных = Параметры.АдресДанных;
	Год         = Параметры.Год;
	
	ДанныеОтпусков = ПолучитьИзВременногоХранилища(АдресДанных);
	УдалитьИзВременногоХранилища(АдресДанных);
	
	ЗаполнитьДиаграммуГанта(ДанныеОтпусков);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграммуГанта(ДанныеОтпусков)
	
	Диаграмма.Очистить();
	
	Если ДанныеОтпусков = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТочкиСотрудников = Новый Соответствие;
	Для Каждого Запись Из ДанныеОтпусков Цикл
		
		Если ТочкиСотрудников[Запись.Сотрудник] = Неопределено Тогда
			Точка       = Диаграмма.УстановитьТочку(Строка(Запись.Сотрудник));
			Точка.Текст = Строка(Запись.Сотрудник);
			ТочкиСотрудников.Вставить(Запись.Сотрудник, Точка);
		КонецЕсли;
		
	КонецЦикла;
	
	Серия       = Диаграмма.УстановитьСерию("Отпуск");
	Серия.Текст = "Плановый отпуск";
	
	Для Каждого Запись Из ДанныеОтпусков Цикл
		
		Если Не ЗначениеЗаполнено(Запись.ДатаНачала) Или Не ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = Диаграмма.ПолучитьЗначение(ТочкиСотрудников[Запись.Сотрудник], Серия);
		
		Интервал        = Значение.Добавить();
		Интервал.Начало = Запись.ДатаНачала;
		Интервал.Конец  = КонецДня(Запись.ДатаОкончания);
		Интервал.Текст  = Строка(Запись.Сотрудник);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
